#
# Copyright 2007-2008 Sun Microsystems, Inc.  All Rights Reserved.
# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.
#
# This code is free software; you can redistribute it and/or modify it
# under the terms of the GNU General Public License version 2 only, as
# published by the Free Software Foundation.  Sun designates this
# particular file as subject to the "Classpath" exception as provided
# by Sun in the LICENSE file that accompanied this code.
#
# This code is distributed in the hope that it will be useful, but WITHOUT
# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
# FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
# version 2 for more details (a copy is included in the LICENSE file that
# accompanied this code).
#
# You should have received a copy of the GNU General Public License version
# 2 along with this work; if not, write to the Free Software Foundation,
# Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.
#
# Please contact Sun Microsystems, Inc., 4150 Network Circle, Santa Clara,
# CA 95054 USA or visit www.sun.com if you need additional information or
# have any questions.

OpenIDE-Module-Name=VisualVM - \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u7a2e\u985e

LBL_NbPlatformApplication=NetBeans \u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3

LBL_Unknown_Application=<\u4e0d\u660e\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3>

LBL_Unknown_Version=<\u4e0d\u660e\u306a\u30d0\u30fc\u30b8\u30e7\u30f3>

LBL_Java_Plug-in_ver=Java \u30d7\u30e9\u30b0\u30a4\u30f3 {0}

LBL_Java_Plug-in=Java \u30d7\u30e9\u30b0\u30a4\u30f3

LBL_Java_Web_Start=Java Web Start

LBL_Unknown=<\u4e0d\u660e>

DESCR_VisualVMApplicationType=VisualVM \u306f\u3001\u3044\u304f\u3064\u304b\u306e\u30b3\u30de\u30f3\u30c9\u884c JDK \u30c4\u30fc\u30eb\u3068\u8efd\u91cf\u30d7\u30ed\u30d5\u30a1\u30a4\u30eb\u6a5f\u80fd\u3092\u7d71\u5408\u3057\u305f\u8996\u899a\u7684\u306a\u30c4\u30fc\u30eb\u3067\u3059\u3002
DESCR_NetBeansBasedApplicationType=NetBeans \u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u4e0a\u306b\u69cb\u7bc9\u3055\u308c\u305f Java \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u3002
DESCR_NetBeansApplicationType=NetBeans IDE: \u5fc5\u8981\u306a IDE \u306f\u3053\u308c 1 \u3064\u3060\u3051 !Windows\u3001Linux\u3001Mac OS X\u3001Solaris \u306b\u5bfe\u5fdc\u3057\u3066\u3044\u307e\u3059\u3002\u30aa\u30fc\u30d7\u30f3\u30bd\u30fc\u30b9\u3067\u7121\u511f\u306e NetBeans IDE \u3067\u3059\u3002
DESCR_JDeveloperApplicationType=Oracle JDeveloper \u306f\u3001Java \u30d9\u30fc\u30b9\u306e SOA \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u958b\u767a\u3092\u7c21\u7d20\u5316\u3059\u308b\u3001\u307e\u305f\u958b\u767a\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u5168\u4f53\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u306e\u7121\u511f\u306e\u7dcf\u5408\u958b\u767a\u74b0\u5883\u3067\u3059\u3002
DESCR_MavenApplicationType=Apache Maven \u306f\u3001\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u7ba1\u7406\u3001\u7406\u89e3\u3059\u308b\u305f\u3081\u306e\u30c4\u30fc\u30eb\u3067\u3059\u3002\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30e2\u30c7\u30eb (POM) \u306e\u6982\u5ff5\u306b\u57fa\u3065\u304d\u3001Maven \u3067\u306f\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u69cb\u7bc9\u3001\u30ec\u30dd\u30fc\u30c8\u3001\u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u4f5c\u6210\u3092\u4e00\u5143\u7ba1\u7406\u3067\u304d\u307e\u3059\u3002
DESCR_Ant=Apache Ant \u306f\u3001Java \u30d9\u30fc\u30b9\u306e\u69cb\u7bc9\u30c4\u30fc\u30eb\u3067\u3059\u3002\u7406\u8ad6\u7684\u306b\u306f\u3001make \u306e\u6b20\u70b9\u306e\u306a\u3044 make \u306e\u4e00\u7a2e\u3067\u3059\u3002
DESCR_GlassFish=GlassFish \u306f\u3001Java EE \u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u7528\u306e\u30aa\u30fc\u30d7\u30f3\u30bd\u30fc\u30b9\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3067\u3059\u3002
DESCR_Tomcat=Apache Tomcat \u306f\u3001Java \u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u304a\u3088\u3073 JavaServer Pages \u30c6\u30af\u30ce\u30ed\u30b8\u306e\u30aa\u30fc\u30d7\u30f3\u30bd\u30fc\u30b9\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u5b9f\u88c5\u3067\u3059\u3002
DESCR_JBoss=JBoss Application Server \u306f\u3001100% Pure Java \u3067\u5b9f\u88c5\u3055\u308c\u305f\u3001\u30aa\u30fc\u30d7\u30f3\u30bd\u30fc\u30b9\u3067\u6a19\u6e96\u6e96\u62e0\u306e\u3001J2EE \u30d9\u30fc\u30b9\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u30fc\u3067\u3059\u3002
DESCR_JConsole=jconsole: Java \u4eee\u60f3\u30de\u30b7\u30f3\u3092\u76e3\u8996\u3059\u308b\u305f\u3081\u306e\u3001JMX \u6e96\u62e0\u306e\u30b0\u30e9\u30d5\u30a3\u30ab\u30eb\u30c4\u30fc\u30eb\u3002
DESCR_Jps=jps: Java \u4eee\u60f3\u30de\u30b7\u30f3\u30d7\u30ed\u30bb\u30b9\u30b9\u30c6\u30fc\u30bf\u30b9\u30c4\u30fc\u30eb\u3002\u30bf\u30fc\u30b2\u30c3\u30c8\u30b7\u30b9\u30c6\u30e0\u4e0a\u306b\u8a08\u88c5\u3055\u308c\u305f HotSpot Java \u4eee\u60f3\u30de\u30b7\u30f3 (JVM) \u3092\u4e00\u89a7\u8868\u793a\u3057\u307e\u3059\u3002
DESCR_Jstat=jstat: Java \u4eee\u60f3\u30de\u30b7\u30f3\u7d71\u8a08\u76e3\u8996\u30c4\u30fc\u30eb\u3002\u8a08\u88c5\u3055\u308c\u305f HotSpot Java \u4eee\u60f3\u30de\u30b7\u30f3 (JVM) \u306e\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u7d71\u8a08\u3092\u8868\u793a\u3057\u307e\u3059\u3002
DESCR_Jstatd=jstatd: \u4eee\u60f3\u30de\u30b7\u30f3\u306e jstat \u30c7\u30fc\u30e2\u30f3\u3002\u8a08\u88c5\u3055\u308c\u305f HotSpot Java \u4eee\u60f3\u30de\u30b7\u30f3 (JVM) \u306e\u4f5c\u6210\u3068\u7d42\u4e86\u3092\u76e3\u8996\u3057\u3001\u30ed\u30fc\u30ab\u30eb\u30db\u30b9\u30c8\u3067\u5b9f\u884c\u3057\u3066\u3044\u308b JVM \u306b\u3001\u30ea\u30e2\u30fc\u30c8\u76e3\u8996\u30c4\u30fc\u30eb\u304c\u63a5\u7d9a\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u305f\u3081\u306e\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u3092\u63d0\u4f9b\u3059\u308b RMI \u30b5\u30fc\u30d0\u30fc\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u3002
DESCR_Jstack=jstack: \u6307\u5b9a\u3055\u308c\u305f Java \u30d7\u30ed\u30bb\u30b9\u3084\u30b3\u30a2\u30d5\u30a1\u30a4\u30eb\u3001\u307e\u305f\u306f\u30ea\u30e2\u30fc\u30c8\u30c7\u30d0\u30c3\u30b0\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3059\u308b Java \u30b9\u30ec\u30c3\u30c9\u306e Java \u30b9\u30bf\u30c3\u30af\u30c8\u30ec\u30fc\u30b9\u3092\u51fa\u529b\u3057\u307e\u3059\u3002
DESCR_Jmap=jmap: \u6307\u5b9a\u3055\u308c\u305f\u30d7\u30ed\u30bb\u30b9\u3084\u30b3\u30a2\u30d5\u30a1\u30a4\u30eb\u3001\u307e\u305f\u306f\u30ea\u30e2\u30fc\u30c8\u30c7\u30d0\u30c3\u30b0\u30b5\u30fc\u30d0\u30fc\u306e\u3001\u5171\u6709\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30e1\u30e2\u30ea\u30fc\u30de\u30c3\u30d7\u307e\u305f\u306f\u30d2\u30fc\u30d7\u30e1\u30e2\u30ea\u30fc\u306e\u8a73\u7d30\u3092\u51fa\u529b\u3057\u307e\u3059\u3002
DESCR_Jhat=jhat: Java \u30d2\u30fc\u30d7\u89e3\u6790\u30c4\u30fc\u30eb\u3002Java \u30d2\u30fc\u30d7\u30c0\u30f3\u30d7\u30d5\u30a1\u30a4\u30eb\u3092\u89e3\u6790\u3057\u3066 Web \u30b5\u30fc\u30d0\u30fc\u3092\u8d77\u52d5\u3057\u3001Web \u30d6\u30e9\u30a6\u30b6\u3092\u4f7f\u7528\u3057\u3066\u30d2\u30fc\u30d7\u30c0\u30f3\u30d7\u3092\u8868\u793a\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002
DESCR_Jinfo=jinfo: \u6307\u5b9a\u3055\u308c\u305f Java \u30d7\u30ed\u30bb\u30b9\u3084\u30b3\u30a2\u30d5\u30a1\u30a4\u30eb\u3001\u307e\u305f\u306f\u30ea\u30e2\u30fc\u30c8\u30c7\u30d0\u30c3\u30b0\u30b5\u30fc\u30d0\u30fc\u306e Java \u69cb\u6210\u60c5\u5831\u3092\u51fa\u529b\u3057\u307e\u3059\u3002
DESCR_Jsadebugd=jsadebugd: \u30b5\u30fc\u30d3\u30b9\u30a2\u30d3\u30ea\u30c6\u30a3\u30fc\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u30c7\u30d0\u30c3\u30b0\u30c7\u30fc\u30e2\u30f3\u3002Java \u30d7\u30ed\u30bb\u30b9\u307e\u305f\u306f\u30b3\u30a2\u30d5\u30a1\u30a4\u30eb\u306b\u63a5\u7d9a\u3057\u3001\u30c7\u30d0\u30c3\u30b0\u30b5\u30fc\u30d0\u30fc\u3068\u3057\u3066\u6a5f\u80fd\u3057\u307e\u3059\u3002
DESCR_Jar=jar: Java \u30a2\u30fc\u30ab\u30a4\u30d6\u30c4\u30fc\u30eb\u3002\u8907\u6570\u306e\u30d5\u30a1\u30a4\u30eb\u3092 1 \u3064\u306e JAR \u30a2\u30fc\u30ab\u30a4\u30d6\u30d5\u30a1\u30a4\u30eb\u306b\u7d71\u5408\u3057\u307e\u3059\u3002
DESCR_Pack200=pack200: JAR \u30d1\u30c3\u30af\u30c4\u30fc\u30eb\u3002Java gzip \u5727\u7e2e\u30d7\u30ed\u30b0\u30e9\u30e0\u3092\u4f7f\u7528\u3057\u3066 JAR \u30d5\u30a1\u30a4\u30eb\u3092 pack200 \u5727\u7e2e\u30d5\u30a1\u30a4\u30eb\u306b\u5909\u63db\u3059\u308b Java \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u3002
DESCR_JavaDoc=javadoc: Java API \u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u30b8\u30a7\u30cd\u30ec\u30fc\u30bf\u3002Java \u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u304b\u3089 API \u30c9\u30ad\u30e5\u30e1\u30f3\u30c8\u306e HTML \u30da\u30fc\u30b8\u3092\u751f\u6210\u3057\u307e\u3059\u3002
DESCR_Javac=javac: Java \u30d7\u30ed\u30b0\u30e9\u30df\u30f3\u30b0\u8a00\u8a9e\u30b3\u30f3\u30d1\u30a4\u30e9\u3002Java \u30d7\u30ed\u30b0\u30e9\u30df\u30f3\u30b0\u8a00\u8a9e\u3067\u8a18\u8ff0\u3055\u308c\u305f\u30af\u30e9\u30b9\u3068\u30a4\u30f3\u30bf\u30d5\u30a7\u30fc\u30b9\u5b9a\u7fa9\u3092\u8aad\u307f\u53d6\u308a\u3001\u30d0\u30a4\u30c8\u30b3\u30fc\u30c9\u306e\u30af\u30e9\u30b9\u30d5\u30a1\u30a4\u30eb\u306b\u30b3\u30f3\u30d1\u30a4\u30eb\u3057\u307e\u3059\u3002
DESCR_Javah=javah: C \u30d8\u30c3\u30c0\u30fc\u3068\u30b9\u30bf\u30d6\u30d5\u30a1\u30a4\u30eb\u30b8\u30a7\u30cd\u30ec\u30fc\u30bf\u3002\u30cd\u30a4\u30c6\u30a3\u30d6\u30e1\u30bd\u30c3\u30c9\u3092\u5b9f\u88c5\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a C \u30d8\u30c3\u30c0\u30fc\u3068\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u3092\u751f\u6210\u3057\u307e\u3059\u3002
DESCR_Javap=javap: Java \u30af\u30e9\u30b9\u30d5\u30a1\u30a4\u30eb\u9006\u30a2\u30bb\u30f3\u30d6\u30e9\u3002\u30af\u30e9\u30b9\u30d5\u30a1\u30a4\u30eb\u3092\u9006\u30a2\u30bb\u30f3\u30d6\u30eb\u3057\u307e\u3059\u3002
DESCR_JarSigner=jarsigner: JAR \u7f72\u540d\u304a\u3088\u3073\u691c\u8a3c\u30c4\u30fc\u30eb\u3002JAR (Java ARchive) \u30d5\u30a1\u30a4\u30eb\u3078\u306e\u7f72\u540d\u3001\u304a\u3088\u3073\u7f72\u540d\u4ed8\u304d JAR \u30d5\u30a1\u30a4\u30eb\u306e\u7f72\u540d\u3068\u6574\u5408\u6027\u306e\u691c\u8a3c\u306e\u305f\u3081\u306b\u4f7f\u7528\u3057\u307e\u3059\u3002
DESCR_Apt=apt: \u6ce8\u91c8\u51e6\u7406\u30c4\u30fc\u30eb\u3002\u691c\u67fb\u304c\u884c\u308f\u308c\u3066\u3044\u308b\u4e00\u9023\u306e\u6307\u5b9a\u3055\u308c\u305f\u30bd\u30fc\u30b9\u30d5\u30a1\u30a4\u30eb\u306b\u5b58\u5728\u3059\u308b\u6ce8\u91c8\u306b\u57fa\u3065\u3044\u3066\u3001\u6ce8\u91c8\u30d7\u30ed\u30bb\u30c3\u30b5\u3092\u691c\u51fa\u3057\u5b9f\u884c\u3057\u307e\u3059\u3002
DESCR_AppletViewer=appletviewer: Java \u30a2\u30d7\u30ec\u30c3\u30c8\u30d3\u30e5\u30fc\u30a2\u3002World-Wide Web \u30d6\u30e9\u30a6\u30b6\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u5916\u3067\u30a2\u30d7\u30ec\u30c3\u30c8\u3092\u5b9f\u884c\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002
DESCR_JavaDb=Java DB \u306f Sun \u304c\u30b5\u30dd\u30fc\u30c8\u3059\u308b Apache Derby \u30aa\u30fc\u30d7\u30f3\u30bd\u30fc\u30b9\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30c7\u30a3\u30b9\u30c8\u30ea\u30d3\u30e5\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u3002Java DB \u306f 100% Java \u30c6\u30af\u30ce\u30ed\u30b8\u3067\u3001\u7c21\u5358\u306b\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002
DESCR_JdkDemoApp=JFC \u30c7\u30e2\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3002

